---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinLengthn1
source: html/27ea4d95-3c26-ee56-53ba-af472a629ee1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinLengthn1 Property

"Primary Bar - Length"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinLengthn1 { get; }
```